desafio-17-desplegar-nuestro-proyecto-en-la-nube/desafio-16-tests/archivos/test-con-log/artillery-log.txt
Phase started: unnamed (index: 0, duration: 1s) 06:47:15(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 06:47:16(-0300)

--------------------------------------
Metrics for period to: 06:47:20(-0300) (width: 2.288s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 439/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 61
  median: ...................................................................... 30.3
  p95: ......................................................................... 48.9
  p99: ......................................................................... 57.4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 940
  max: ......................................................................... 1666.3
  median: ...................................................................... 1525.7
  p95: ......................................................................... 1652.8
  p99: ......................................................................... 1652.8


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 06:47:19(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 439/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 61
  median: ...................................................................... 30.3
  p95: ......................................................................... 48.9
  p99: ......................................................................... 57.4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 940
  max: ......................................................................... 1666.3
  median: ...................................................................... 1525.7
  p95: ......................................................................... 1652.8
  p99: ......................................................................... 1652.8